dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxCpu_reg.h
/** \brief FC8C, CPUx Overlay Mask Register 31 */
#define CPU1_BLK31_OMASK /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BLK_OMASK*)0xF882FC8Cu)
/** Alias (User Manual Name) for CPU1_BLK31_OMASK.
* To use register names with standard convension, please use CPU1_BLK31_OMASK.
*/
#define CPU1_OMASK31 (CPU1_BLK31_OMASK)

/** \brief 1030, CPUx SRI Error Generation Register */
#define CPU1_SEGEN /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SEGEN*)0xF8831030u)

/** \brief 8004, CPUx Task Address Space Identifier Register */
#define CPU1_TASK_ASI /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TASK_ASI*)0xF8838004u)

/** \brief 8100, CPUx Data Access CacheabilityRegister */
#define CPU1_PMA0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PMA0*)0xF8838100u)

/** \brief 8104, CPUx Code Access CacheabilityRegister */
#define CPU1_PMA1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PMA1*)0xF8838104u)

/** \brief 8108, CPUx  Peripheral Space Identifier register */
#define CPU1_PMA2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PMA2*)0xF8838108u)

/** \brief 9000, CPUx Data Control Register 2 */
#define CPU1_DCON2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DCON2*)0xF8839000u)

/** \brief 900C, CPUx SIST Mode Access Control Register */
#define CPU1_SMACON /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SMACON*)0xF883900Cu)

/** \brief 9010, CPUx Data Synchronous Trap Register */
#define CPU1_DSTR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DSTR*)0xF8839010u)

/** \brief 9018, CPUx Data Asynchronous Trap Register */
#define CPU1_DATR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DATR*)0xF8839018u)

/** \brief 901C, CPUx Data Error Address Register */
#define CPU1_DEADD /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DEADD*)0xF883901Cu)

/** \brief 9020, CPUx Data Integrity Error Address Register */
#define CPU1_DIEAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DIEAR*)0xF8839020u)

/** \brief 9024, CPUx Data Integrity Error Trap Register */
#define CPU1_DIETR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DIETR*)0xF8839024u)

/** \brief 9040, CPUx Data Memory Control Register */
#define CPU1_DCON0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DCON0*)0xF8839040u)

/** \brief 9200, CPUx Program Synchronous Trap Register */
#define CPU1_PSTR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PSTR*)0xF8839200u)

/** \brief 9204, CPUx Program Control 1 */
#define CPU1_PCON1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PCON1*)0xF8839204u)

/** \brief 9208, CPUx Program Control 2 */
#define CPU1_PCON2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PCON2*)0xF8839208u)

/** \brief 920C, CPUx Program Control 0 */
#define CPU1_PCON0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PCON0*)0xF883920Cu)

/** \brief 9210, CPUx Program Integrity Error Address Register */
#define CPU1_PIEAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PIEAR*)0xF8839210u)

/** \brief 9214, CPUx Program Integrity Error Trap Register */
#define CPU1_PIETR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PIETR*)0xF8839214u)

/** \brief 9400, CPUx Compatibility Control Register */
#define CPU1_COMPAT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_COMPAT*)0xF8839400u)

/** \brief A000, CPUx Trap Control Register */
#define CPU1_FPU_TRAP_CON /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FPU_TRAP_CON*)0xF883A000u)

/** \brief A004, CPUx Trapping Instruction Program Counter Register */
#define CPU1_FPU_TRAP_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FPU_TRAP_PC*)0xF883A004u)

/** \brief A008, CPUx Trapping Instruction Opcode Register */
#define CPU1_FPU_TRAP_OPC /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FPU_TRAP_OPC*)0xF883A008u)

/** \brief A010, CPUx Trapping Instruction Operand Register */
#define CPU1_FPU_TRAP_SRC1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FPU_TRAP_SRC1*)0xF883A010u)

/** \brief A014, CPUx Trapping Instruction Operand Register */
#define CPU1_FPU_TRAP_SRC2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FPU_TRAP_SRC2*)0xF883A014u)

/** \brief A018, CPUx Trapping Instruction Operand Register */
#define CPU1_FPU_TRAP_SRC3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FPU_TRAP_SRC3*)0xF883A018u)

/** \brief C000, CPUx Data Protection Range 0, Lower Bound Register */
#define CPU1_DPR0_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF883C000u)

/** \brief C004, CPUx Data Protection Range 0, Upper Bound Register */
#define CPU1_DPR0_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF883C004u)

/** \brief C008, CPUx Data Protection Range 1, Lower Bound Register */
#define CPU1_DPR1_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF883C008u)

/** \brief C00C, CPUx Data Protection Range 1, Upper Bound Register */
#define CPU1_DPR1_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF883C00Cu)

/** \brief C010, CPUx Data Protection Range 2, Lower Bound Register */
#define CPU1_DPR2_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF883C010u)

/** \brief C014, CPUx Data Protection Range 2, Upper Bound Register */
#define CPU1_DPR2_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF883C014u)

/** \brief C018, CPUx Data Protection Range 3, Lower Bound Register */
#define CPU1_DPR3_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF883C018u)

/** \brief C01C, CPUx Data Protection Range 3, Upper Bound Register */
#define CPU1_DPR3_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF883C01Cu)

/** \brief C020, CPUx Data Protection Range 4, Lower Bound Register */
#define CPU1_DPR4_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF883C020u)

/** \brief C024, CPUx Data Protection Range 4, Upper Bound Register */
#define CPU1_DPR4_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF883C024u)

/** \brief C028, CPUx Data Protection Range 5, Lower Bound Register */
#define CPU1_DPR5_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF883C028u)

/** \brief C02C, CPUx Data Protection Range 5, Upper Bound Register */
#define CPU1_DPR5_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF883C02Cu)

/** \brief C030, CPUx Data Protection Range 6, Lower Bound Register */
#define CPU1_DPR6_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF883C030u)

/** \brief C034, CPUx Data Protection Range 6, Upper Bound Register */
#define CPU1_DPR6_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF883C034u)

/** \brief C038, CPUx Data Protection Range 7, Lower Bound Register */
#define CPU1_DPR7_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF883C038u)

/** \brief C03C, CPUx Data Protection Range 7, Upper Bound Register */
#define CPU1_DPR7_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF883C03Cu)

