dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxCpu_reg.h
/** \brief E068, CPUx Safety Protection SPR Region Write Access Enable Register A6 */
#define CPU2_RGN6_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENA*)0xF884E068u)
/** Alias (User Manual Name) for CPU2_RGN6_ACCENA.
* To use register names with standard convension, please use CPU2_RGN6_ACCENA.
*/
#define CPU2_SPR_SPROT_RGNACCENA6_W (CPU2_RGN6_ACCENA)

/** \brief E06C, CPUx Safety Protection SPR Region Write Access Enable Register B6 */
#define CPU2_RGN6_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENB*)0xF884E06Cu)
/** Alias (User Manual Name) for CPU2_RGN6_ACCENB.
* To use register names with standard convension, please use CPU2_RGN6_ACCENB.
*/
#define CPU2_SPR_SPROT_RGNACCENB6_W (CPU2_RGN6_ACCENB)

/** \brief E070, CPUx Safety Protection SPR Region Lower Address Register 7 */
#define CPU2_RGN7_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_LA*)0xF884E070u)
/** Alias (User Manual Name) for CPU2_RGN7_LA.
* To use register names with standard convension, please use CPU2_RGN7_LA.
*/
#define CPU2_SPR_SPROT_RGNLA7 (CPU2_RGN7_LA)

/** \brief E074, CPUx Safety Protection SPR Region Upper Address Register 7 */
#define CPU2_RGN7_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_UA*)0xF884E074u)
/** Alias (User Manual Name) for CPU2_RGN7_UA.
* To use register names with standard convension, please use CPU2_RGN7_UA.
*/
#define CPU2_SPR_SPROT_RGNUA7 (CPU2_RGN7_UA)

/** \brief E078, CPUx Safety Protection SPR Region Write Access Enable Register A7 */
#define CPU2_RGN7_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENA*)0xF884E078u)
/** Alias (User Manual Name) for CPU2_RGN7_ACCENA.
* To use register names with standard convension, please use CPU2_RGN7_ACCENA.
*/
#define CPU2_SPR_SPROT_RGNACCENA7_W (CPU2_RGN7_ACCENA)

/** \brief E07C, CPUx Safety Protection SPR Region Write Access Enable Register B7 */
#define CPU2_RGN7_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENB*)0xF884E07Cu)
/** Alias (User Manual Name) for CPU2_RGN7_ACCENB.
* To use register names with standard convension, please use CPU2_RGN7_ACCENB.
*/
#define CPU2_SPR_SPROT_RGNACCENB7_W (CPU2_RGN7_ACCENB)

/** \brief E088, CPUx Safety Protection SPR Region Read Access Enable Register A0 */
#define CPU2_SPR_SPROT_RGNACCENA_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENA_R*)0xF884E088u)
/** Alias (User Manual Name) for CPU2_SPR_SPROT_RGNACCENA_R0.
* To use register names with standard convension, please use CPU2_SPR_SPROT_RGNACCENA_R0.
*/
#define CPU2_SPR_SPROT_RGNACCENA0_R (CPU2_SPR_SPROT_RGNACCENA_R0)

/** \brief E08C, CPUx Safety Protection SPR Region Read Access Enable Register B0 */
#define CPU2_SPR_SPROT_RGNACCENB_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENB_R*)0xF884E08Cu)
/** Alias (User Manual Name) for CPU2_SPR_SPROT_RGNACCENB_R0.
* To use register names with standard convension, please use CPU2_SPR_SPROT_RGNACCENB_R0.
*/
#define CPU2_SPR_SPROT_RGNACCENB0_R (CPU2_SPR_SPROT_RGNACCENB_R0)

/** \brief E098, CPUx Safety Protection SPR Region Read Access Enable Register A1 */
#define CPU2_SPR_SPROT_RGNACCENA_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENA_R*)0xF884E098u)
/** Alias (User Manual Name) for CPU2_SPR_SPROT_RGNACCENA_R1.
* To use register names with standard convension, please use CPU2_SPR_SPROT_RGNACCENA_R1.
*/
#define CPU2_SPR_SPROT_RGNACCENA1_R (CPU2_SPR_SPROT_RGNACCENA_R1)

/** \brief E09C, CPUx Safety Protection SPR Region Read Access Enable Register B1 */
#define CPU2_SPR_SPROT_RGNACCENB_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENB_R*)0xF884E09Cu)
/** Alias (User Manual Name) for CPU2_SPR_SPROT_RGNACCENB_R1.
* To use register names with standard convension, please use CPU2_SPR_SPROT_RGNACCENB_R1.
*/
#define CPU2_SPR_SPROT_RGNACCENB1_R (CPU2_SPR_SPROT_RGNACCENB_R1)

/** \brief E0A8, CPUx Safety Protection SPR Region Read Access Enable Register A2 */
#define CPU2_SPR_SPROT_RGNACCENA_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENA_R*)0xF884E0A8u)
/** Alias (User Manual Name) for CPU2_SPR_SPROT_RGNACCENA_R2.
* To use register names with standard convension, please use CPU2_SPR_SPROT_RGNACCENA_R2.
*/
#define CPU2_SPR_SPROT_RGNACCENA2_R (CPU2_SPR_SPROT_RGNACCENA_R2)

/** \brief E0AC, CPUx Safety Protection SPR Region Read Access Enable Register B2 */
#define CPU2_SPR_SPROT_RGNACCENB_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENB_R*)0xF884E0ACu)
/** Alias (User Manual Name) for CPU2_SPR_SPROT_RGNACCENB_R2.
* To use register names with standard convension, please use CPU2_SPR_SPROT_RGNACCENB_R2.
*/
#define CPU2_SPR_SPROT_RGNACCENB2_R (CPU2_SPR_SPROT_RGNACCENB_R2)

/** \brief E0B8, CPUx Safety Protection SPR Region Read Access Enable Register A3 */
#define CPU2_SPR_SPROT_RGNACCENA_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENA_R*)0xF884E0B8u)
/** Alias (User Manual Name) for CPU2_SPR_SPROT_RGNACCENA_R3.
* To use register names with standard convension, please use CPU2_SPR_SPROT_RGNACCENA_R3.
*/
#define CPU2_SPR_SPROT_RGNACCENA3_R (CPU2_SPR_SPROT_RGNACCENA_R3)

/** \brief E0BC, CPUx Safety Protection SPR Region Read Access Enable Register B3 */
#define CPU2_SPR_SPROT_RGNACCENB_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENB_R*)0xF884E0BCu)
/** Alias (User Manual Name) for CPU2_SPR_SPROT_RGNACCENB_R3.
* To use register names with standard convension, please use CPU2_SPR_SPROT_RGNACCENB_R3.
*/
#define CPU2_SPR_SPROT_RGNACCENB3_R (CPU2_SPR_SPROT_RGNACCENB_R3)

/** \brief E0C8, CPUx Safety Protection SPR Region Read Access Enable Register A4 */
#define CPU2_SPR_SPROT_RGNACCENA_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENA_R*)0xF884E0C8u)
/** Alias (User Manual Name) for CPU2_SPR_SPROT_RGNACCENA_R4.
* To use register names with standard convension, please use CPU2_SPR_SPROT_RGNACCENA_R4.
*/
#define CPU2_SPR_SPROT_RGNACCENA4_R (CPU2_SPR_SPROT_RGNACCENA_R4)

/** \brief E0CC, CPUx Safety Protection SPR Region Read Access Enable Register B4 */
#define CPU2_SPR_SPROT_RGNACCENB_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENB_R*)0xF884E0CCu)
/** Alias (User Manual Name) for CPU2_SPR_SPROT_RGNACCENB_R4.
* To use register names with standard convension, please use CPU2_SPR_SPROT_RGNACCENB_R4.
*/
#define CPU2_SPR_SPROT_RGNACCENB4_R (CPU2_SPR_SPROT_RGNACCENB_R4)

/** \brief E0D8, CPUx Safety Protection SPR Region Read Access Enable Register A5 */
#define CPU2_SPR_SPROT_RGNACCENA_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENA_R*)0xF884E0D8u)
/** Alias (User Manual Name) for CPU2_SPR_SPROT_RGNACCENA_R5.
* To use register names with standard convension, please use CPU2_SPR_SPROT_RGNACCENA_R5.
*/
#define CPU2_SPR_SPROT_RGNACCENA5_R (CPU2_SPR_SPROT_RGNACCENA_R5)

/** \brief E0DC, CPUx Safety Protection SPR Region Read Access Enable Register B5 */
#define CPU2_SPR_SPROT_RGNACCENB_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENB_R*)0xF884E0DCu)
/** Alias (User Manual Name) for CPU2_SPR_SPROT_RGNACCENB_R5.
* To use register names with standard convension, please use CPU2_SPR_SPROT_RGNACCENB_R5.
*/
#define CPU2_SPR_SPROT_RGNACCENB5_R (CPU2_SPR_SPROT_RGNACCENB_R5)

/** \brief E0E8, CPUx Safety Protection SPR Region Read Access Enable Register A6 */
#define CPU2_SPR_SPROT_RGNACCENA_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENA_R*)0xF884E0E8u)
/** Alias (User Manual Name) for CPU2_SPR_SPROT_RGNACCENA_R6.
* To use register names with standard convension, please use CPU2_SPR_SPROT_RGNACCENA_R6.
*/
#define CPU2_SPR_SPROT_RGNACCENA6_R (CPU2_SPR_SPROT_RGNACCENA_R6)

